apojomovsky/pic8-hal/pic18fxx5x-hal/include/pic18fxx5x_sfr.h
/**
 * @file    pic18fxx5x_sfr.h
 * @brief   Special Function Register (SFR) address map for the
 *          PIC18F2455/2550/4455/4550 family (MVP subset).
 *
 * @details
 *   Every address, bit mask and reset value in this file is taken 1-to-1
 *   from the DS39632E datasheet:
 *     - Table 5-1, SFR Map (Access Bank 0xF60-0xFFF). The addresses are
 *       cross-checked against the PIC18Fxxxx DFP device header
 *       (pic/include/proc/pic18f4550.inc), the compiler's own datasheet-
 *       derived register map.
 *     - Register 5-2 (STATUS), Register 4-1/9-10 (RCON),
 *       Register 9-1/9-2/9-3 (INTCON/INTCON2/INTCON3),
 *       Register 9-5/9-6/9-8 (PIR1/PIE1/IPR1), Register 10-1 (PORTB),
 *       Register 11-1 (T0CON).
 *
 *   The macro naming (<tt>PIC_REG_* / PIC_*_*</tt>) deliberately matches
 *   pic16f87xa_sfr.h so that driver source reads identically across
 *   families: <tt>PIC8_REG8(PIC_REG_INTCON)</tt> resolves to 0x0B on PIC16
 *   and 0xFF2 on PIC18, selected by which family's headers are on the
 *   include path. Only one family's sfr.h is ever in a given translation
 *   unit, so the shared <tt>PIC_</tt> prefix never collides.
 *
 *   Phase 2 scope (the plan's MVP vertical slice): STATUS, BSR, RCON,
 *   PORTA-E / LATA-E / TRISA-E, INTCON / INTCON2 / INTCON3,
 *   PIR1 / PIE1 / IPR1, TMR0L / TMR0H / T0CON. Every SFR here is in the
 *   Access Bank (0xF60-0xFFF), so no BSR banking is needed to reach any
 *   of them (DS39632E §5.3). PORTD / PORTE / LATD / LATE / TRISD / TRISE
 *   exist only on the 40/44-pin parts (4455/4550) and are gated with
 *   PIC18FXX5X_FAMILY_HAS_PORTD / HAS_PORTE.
 */

#ifndef PIC18FXX5X_SFR_H
#define PIC18FXX5X_SFR_H

#include "pic18fxx5x.h"

/* ───────────────────────── Access Bank SFR addresses ────────────── */
/* DS39632E Table 5-1, SFR Map. All in the Access Bank (0xF60-0xFFF). */

/* Core CPU status, DS39632E Register 5-2. */
#define PIC_REG_STATUS        0xFD8U   /**< ALU status (N/OV/Z/DC/C).       */
#define PIC_REG_BSR           0xFE0U   /**< Bank Select Register (low nibble). */
#define PIC_REG_RCON          0xFD0U   /**< Reset Control (IPEN/TO/PD/POR/BOR). */

/* I/O ports, DS39632E §10.0, Table 10-1..10-5.
 * PORTx is the pin input sample; LATx is the output latch; TRISx is the
 * data-direction register. PIC18 exposes LATx as its own mapped register
 * (§10.0), so GPIO writes go through LATx, not PORTx. */
#define PIC_REG_PORTA         0xF80U
#define PIC_REG_PORTB         0xF81U
#define PIC_REG_PORTC         0xF82U
#if PIC18FXX5X_FAMILY_HAS_PORTD
#define PIC_REG_PORTD         0xF83U   /* 40/44-pin only. */
#endif
#if PIC18FXX5X_FAMILY_HAS_PORTE
#define PIC_REG_PORTE         0xF84U   /* 40/44-pin only. */
#endif

#define PIC_REG_LATA          0xF89U
#define PIC_REG_LATB          0xF8AU
#define PIC_REG_LATC          0xF8BU
#if PIC18FXX5X_FAMILY_HAS_PORTD
#define PIC_REG_LATD          0xF8CU   /* 40/44-pin only. */
#endif
#if PIC18FXX5X_FAMILY_HAS_PORTE
#define PIC_REG_LATE          0xF8DU   /* 40/44-pin only. */
#endif

#define PIC_REG_TRISA         0xF92U
#define PIC_REG_TRISB         0xF93U
#define PIC_REG_TRISC         0xF94U
#if PIC18FXX5X_FAMILY_HAS_PORTD
#define PIC_REG_TRISD         0xF95U   /* 40/44-pin only. */
#endif
#if PIC18FXX5X_FAMILY_HAS_PORTE
#define PIC_REG_TRISE         0xF96U   /* 40/44-pin only. */
#endif

/* Interrupt control, DS39632E §9.0, Register 9-1/9-2/9-3. */
#define PIC_REG_INTCON        0xFF2U   /**< GIE/PEIE/TMR0IE/INT0IE/RBIE + flags. */
#define PIC_REG_INTCON2       0xFF1U   /**< Pull-ups, INT edge, TMR0IP, RBIP.   */
#define PIC_REG_INTCON3       0xFF0U   /**< INT1/INT2 enable, flag, priority.   */

/* Peripheral interrupt flag/enable/priority, DS39632E Register 9-5/9-6/9-8. */
#define PIC_REG_PIR1          0xF9EU   /**< Peripheral Interrupt Flag Register 1. */
#define PIC_REG_PIE1          0xF9DU   /**< Peripheral Interrupt Enable Reg 1.    */
#define PIC_REG_IPR1          0xF9FU   /**< Peripheral Interrupt Priority Reg 1.  */
#define PIC_REG_PIR2          0xFA1U   /**< Peripheral Interrupt Flag Register 2 (TMR3IF, CCP2IF, ...). */
#define PIC_REG_PIE2          0xFA0U   /**< Peripheral Interrupt Enable Reg 2.    */
#define PIC_REG_IPR2          0xFA2U   /**< Peripheral Interrupt Priority Reg 2 (reset 0xFF, all high). */

/* Timer0, DS39632E §11.0, Register 11-1. */
#define PIC_REG_T0CON         0xFD5U   /**< Timer0 control (on/8-16bit/src/edge/PSA/PS). */
#define PIC_REG_TMR0L         0xFD6U   /**< Timer0 low byte (also 8-bit mode value). */
#define PIC_REG_TMR0H         0xFD7U   /**< Timer0 high byte (16-bit mode only).    */

/* Timer1, DS39632E §12.0, Register 12-1. 16-bit timer/counter. */
#define PIC_REG_T1CON         0xFCDU   /**< Timer1 control (RD16/run/prescale/osc/sync/cs/on). */
#define PIC_REG_TMR1L         0xFCEU   /**< Timer1 low byte.                          */
#define PIC_REG_TMR1H         0xFCFU   /**< Timer1 high byte.                         */

/* Timer2, DS39632E §12.0, Register 12-2. 8-bit timer with PR2 + postscaler. */
#define PIC_REG_T2CON         0xFCAU   /**< Timer2 control (postscaler/on/prescaler). */
#define PIC_REG_PR2           0xFCBU   /**< Timer2 period register (Access Bank).    */
#define PIC_REG_TMR2          0xFCCU   /**< Timer2 counter.                          */

/* Timer3, DS39632E §14.0, Register 14-1. 16-bit timer/counter (shares T1OSC). */
#define PIC_REG_T3CON         0xFB1U   /**< Timer3 control (RD16/CCP-sel/prescale/sync/cs/on). */
#define PIC_REG_TMR3L         0xFB2U   /**< Timer3 low byte.                          */
#define PIC_REG_TMR3H         0xFB3U   /**< Timer3 high byte.                         */

/* ECCP1 / CCP2, DS39632E §16.0. CCP1 is the Enhanced CCP (dead-band +
 * auto-shutdown, multi-output PWM); CCP2 is the plain CCP. */
#define PIC_REG_ECCP1AS       0xFB6U   /**< ECCP1 auto-shutdown control.              */
#define PIC_REG_ECCP1DEL      0xFB7U   /**< ECCP1 dead-band delay + restart enable.   */
#define PIC_REG_CCP2CON       0xFBAU   /**< CCP2 control (plain).                     */
#define PIC_REG_CCPR2L        0xFBBU   /**< CCP2 compare/capture/PWM duty low.        */
#define PIC_REG_CCPR2H        0xFBCU   /**< CCP2 compare/capture/PWM duty high.       */
#define PIC_REG_CCP1CON       0xFBDU   /**< ECCP1 control (P1M/DC1B/CCP1M).           */
#define PIC_REG_CCPR1L        0xFBEU   /**< ECCP1 compare/capture/PWM duty low.       */
#define PIC_REG_CCPR1H        0xFBFU   /**< ECCP1 compare/capture/PWM duty high.      */

/* MSSP, DS39632E §19.0 (SPI master/slave + I2C master/slave). */
#define PIC_REG_SSPCON2       0xFC5U   /**< MSSP control 2 (I2C master: SEN/PEN/etc). */
#define PIC_REG_SSPCON1       0xFC6U   /**< MSSP control 1 (mode/SSPEN/CKP/WCOL/SSPOV).*/
#define PIC_REG_SSPSTAT       0xFC7U   /**< MSSP status (SMP/CKE/D-A/P/S/R-W/UA/BF).  */
#define PIC_REG_SSPADD        0xFC8U   /**< MSSP address (I2C slave) / baud (master). */
#define PIC_REG_SSPBUF        0xFC9U   /**< MSSP data buffer.                          */

/* EUSART, DS39632E §20.0 (Enhanced USART). The EUSART adds BAUDCON (BRG16,
 * auto-baud, wake-up, sync-clock polarity) and the SPBRGH high byte that the
 * PIC16 plain USART lacks; TXSTA/RCSTA/TXREG/RCREG/SPBRG are the same shape
 * as the PIC16 USART. All in the Access Bank, addresses from the DFP
 * pic18f4550.h SFR map (cross-checked against DS39632E Table 5-1). */
#define PIC_REG_BAUDCON       0xFB8U   /**< EUSART baud-rate control (BRG16/ABDEN/WUE/...). */
#define PIC_REG_RCSTA         0xFABU   /**< EUSART receive control/status.            */
#define PIC_REG_TXSTA         0xFACU   /**< EUSART transmit control/status.            */
#define PIC_REG_TXREG         0xFADU   /**< EUSART transmit data register.             */
#define PIC_REG_RCREG         0xFAEU   /**< EUSART receive data register.              */
#define PIC_REG_SPBRG         0xFAFU   /**< EUSART baud-rate divisor, low byte.        */
#define PIC_REG_SPBRGH        0xFB0U   /**< EUSART baud-rate divisor, high byte (BRG16=1). */

/* Comparator, DS39632E §22.0 (two on-chip comparators). CMCON has the same
 * bit layout as the PIC16 CMCON; only the address differs (Access Bank).
 * CVRCON (comparator voltage reference) is at 0xFB5, ported separately. */
#define PIC_REG_CMCON         0xFB4U   /**< Comparator control (mode/inputs/outputs). */

/* Data EEPROM + Flash, DS39632E §7.0. EECON1 controls read/write; EECON2 is
 * the unlock register (0x55 then 0xAA); EEDATA/EEADR are the data/address
 * registers. The 2455/4550 family has 256 bytes of data EEPROM, addressed
 * by EEADR alone (no EEADRH on this family). All in the Access Bank. */
#define PIC_REG_EECON1        0xFA6U   /**< EEPROM/Flash control (RD/WR/WREN/WRERR/EEPGD). */
#define PIC_REG_EECON2        0xFA7U   /**< EEPROM unlock (write 0x55 then 0xAA).       */
#define PIC_REG_EEDATA        0xFA8U   /**< EEPROM data register.                      */
#define PIC_REG_EEADR         0xFA9U   /**< EEPROM address register (8-bit, 0..255).    */

/* ───────────────────────── STATUS bits (Register 5-2) ───────────── */
#define PIC_STATUS_N          PIC8_BIT(4)   /**< Negative / borrow complement. */
#define PIC_STATUS_OV         PIC8_BIT(3)   /**< Overflow.                     */
#define PIC_STATUS_Z          PIC8_BIT(2)   /**< Zero.                         */
#define PIC_STATUS_DC         PIC8_BIT(1)   /**< Digit carry/borrow.           */
#define PIC_STATUS_C          PIC8_BIT(0)   /**< Carry/borrow.                 */

