apojomovsky/pic8-hal/pic18fxx5x-hal/include/pic18fxx5x_sfr.h
/* ───────────────────────── RCON bits (Register 4-1 / 9-10) ──────── */
#define PIC_RCON_IPEN         PIC8_BIT(7)   /**< Interrupt Priority Enable.    */
#define PIC_RCON_SBOREN       PIC8_BIT(6)   /**< BOR software enable.          */
#define PIC_RCON_RI           PIC8_BIT(4)   /**< RESET instruction flag.       */
#define PIC_RCON_TO           PIC8_BIT(3)   /**< WDT time-out flag (1=not).    */
#define PIC_RCON_PD           PIC8_BIT(2)   /**< Power-down (Sleep) flag (1=not). */
#define PIC_RCON_POR          PIC8_BIT(1)   /**< Power-on Reset status.        */
#define PIC_RCON_BOR          PIC8_BIT(0)   /**< Brown-out Reset status.       */

/* ───────────────────────── INTCON bits (Register 9-1) ───────────── */
#define PIC_INTCON_GIE        PIC8_BIT(7)   /**< Global Int Enable / high-priority GIE. */
#define PIC_INTCON_GIEH       PIC_INTCON_GIE
#define PIC_INTCON_PEIE       PIC8_BIT(6)   /**< Peripheral Int Enable / low-priority GIEL. */
#define PIC_INTCON_GIEL       PIC_INTCON_PEIE
#define PIC_INTCON_TMR0IE     PIC8_BIT(5)   /**< Timer0 overflow interrupt enable. */
#define PIC_INTCON_INT0IE     PIC8_BIT(4)   /**< INT0 external interrupt enable.   */
#define PIC_INTCON_RBIE       PIC8_BIT(3)   /**< RB<7:4> change interrupt enable.  */
#define PIC_INTCON_TMR0IF     PIC8_BIT(2)   /**< Timer0 overflow interrupt flag.   */
#define PIC_INTCON_INT0IF     PIC8_BIT(1)   /**< INT0 external interrupt flag.     */
#define PIC_INTCON_RBIF       PIC8_BIT(0)   /**< RB<7:4> change interrupt flag.    */

/* ───────────────────────── INTCON2 bits (Register 9-2) ──────────── */
#define PIC_INTCON2_RBPU      PIC8_BIT(7)   /**< PORTB pull-up enable (active-low). */
#define PIC_INTCON2_INTEDG0   PIC8_BIT(6)   /**< INT0 edge select (1=rising).       */
#define PIC_INTCON2_INTEDG1   PIC8_BIT(5)   /**< INT1 edge select.                  */
#define PIC_INTCON2_INTEDG2   PIC8_BIT(4)   /**< INT2 edge select.                  */
#define PIC_INTCON2_TMR0IP    PIC8_BIT(2)   /**< Timer0 overflow priority (1=high). */
#define PIC_INTCON2_RBIP      PIC8_BIT(0)   /**< RB change priority (1=high).       */

/* ───────────────────────── INTCON3 bits (Register 9-3) ──────────── */
#define PIC_INTCON3_INT2IP    PIC8_BIT(7)   /**< INT2 priority (1=high).            */
#define PIC_INTCON3_INT1IP    PIC8_BIT(6)   /**< INT1 priority (1=high).            */
#define PIC_INTCON3_INT2IE    PIC8_BIT(4)   /**< INT2 external interrupt enable.    */
#define PIC_INTCON3_INT1IE    PIC8_BIT(3)   /**< INT1 external interrupt enable.    */
#define PIC_INTCON3_INT2IF    PIC8_BIT(1)   /**< INT2 external interrupt flag.      */
#define PIC_INTCON3_INT1IF    PIC8_BIT(0)   /**< INT1 external interrupt flag.      */

/* ───────────────────────── PIR1 / PIE1 / IPR1 bits (Reg 9-5/9-6/9-8) ── */
/* Same bit layout across the three registers: flag / enable / priority. */
#define PIC_PIR1_SPPIF        PIC8_BIT(7)   /**< Streaming Parallel Port flag.  */
#define PIC_PIR1_ADIF         PIC8_BIT(6)   /**< A/D conversion complete flag.  */
#define PIC_PIR1_RCIF         PIC8_BIT(5)   /**< EUSART receive flag.           */
#define PIC_PIR1_TXIF         PIC8_BIT(4)   /**< EUSART transmit flag.          */
#define PIC_PIR1_SSPIF        PIC8_BIT(3)   /**< MSSP flag.                     */
#define PIC_PIR1_CCP1IF       PIC8_BIT(2)   /**< CCP1 flag.                     */
#define PIC_PIR1_TMR2IF       PIC8_BIT(1)   /**< Timer2 match flag.             */
#define PIC_PIR1_TMR1IF       PIC8_BIT(0)   /**< Timer1 overflow flag.          */
#define PIC_PIE1_SPPIE        PIC8_BIT(7)
#define PIC_PIE1_ADIE         PIC8_BIT(6)
#define PIC_PIE1_RCIE         PIC8_BIT(5)
#define PIC_PIE1_TXIE         PIC8_BIT(4)
#define PIC_PIE1_SSPIE        PIC8_BIT(3)
#define PIC_PIE1_CCP1IE       PIC8_BIT(2)
#define PIC_PIE1_TMR2IE       PIC8_BIT(1)
#define PIC_PIE1_TMR1IE       PIC8_BIT(0)
#define PIC_IPR1_SPPIP        PIC8_BIT(7)
#define PIC_IPR1_ADIP         PIC8_BIT(6)
#define PIC_IPR1_RCIP         PIC8_BIT(5)
#define PIC_IPR1_TXIP         PIC8_BIT(4)
#define PIC_IPR1_SSPIP        PIC8_BIT(3)
#define PIC_IPR1_CCP1IP       PIC8_BIT(2)
#define PIC_IPR1_TMR2IP       PIC8_BIT(1)
#define PIC_IPR1_TMR1IP       PIC8_BIT(0)

/* ───────────────────────── T0CON bits (Register 11-1) ───────────── */
#define PIC_T0CON_TMR0ON      PIC8_BIT(7)   /**< Timer0 on/off.                  */
#define PIC_T0CON_T08BIT      PIC8_BIT(6)   /**< 1=8-bit, 0=16-bit mode.         */
#define PIC_T0CON_T0CS        PIC8_BIT(5)   /**< 0=internal Fosc/4, 1=T0CKI pin. */
#define PIC_T0CON_T0SE        PIC8_BIT(4)   /**< Counter mode edge select.       */
#define PIC_T0CON_PSA         PIC8_BIT(3)   /**< 0=prescaler assigned, 1=not.    */
#define PIC_T0CON_T0PS_MASK   0x07U         /**< T0PS2:T0PS0, prescaler ratio.   */

/* ───────────────────────── T1CON bits (Register 12-1) ───────────── */
#define PIC_T1CON_RD16        PIC8_BIT(7)   /**< 16-bit read/write mode enable.   */
#define PIC_T1CON_T1RUN       PIC8_BIT(6)   /**< Timer1 system clock status (RO). */
#define PIC_T1CON_T1CKPS_MASK 0x30U         /**< T1CKPS1:T1CKPS0 at bits 5:4.     */
#define PIC_T1CON_T1OSCEN     PIC8_BIT(3)   /**< Timer1 oscillator enable.       */
#define PIC_T1CON_T1SYNC      PIC8_BIT(2)   /**< External clock sync (1=async).  */
#define PIC_T1CON_TMR1CS      PIC8_BIT(1)   /**< 0=Fosc/4, 1=external/T1OSC.     */
#define PIC_T1CON_TMR1ON      PIC8_BIT(0)   /**< Timer1 on/off.                   */

/* ───────────────────────── T2CON bits (Register 12-2) ───────────── */
#define PIC_T2CON_TOUTPS_MASK 0x78U         /**< T2OUTPS3:T2OUTPS0 at bits 6:3 (1:(N+1)). */
#define PIC_T2CON_TMR2ON      PIC8_BIT(2)   /**< Timer2 on/off.                   */
#define PIC_T2CON_T2CKPS_MASK 0x03U         /**< T2CKPS1:T2CKPS0 at bits 1:0.     */

/* ───────────────────────── T3CON bits (Register 14-1) ───────────── */
#define PIC_T3CON_RD16        PIC8_BIT(7)   /**< 16-bit read/write mode enable.   */
#define PIC_T3CON_T3CCP2      PIC8_BIT(6)   /**< CCP timer-select bit (with T3CCP1). */
#define PIC_T3CON_T3CKPS_MASK 0x30U         /**< T3CKPS1:T3CKPS0 at bits 5:4.     */
#define PIC_T3CON_T3CCP1      PIC8_BIT(3)   /**< CCP timer-select bit (with T3CCP2). */
#define PIC_T3CON_T3SYNC      PIC8_BIT(2)   /**< External clock sync (1=async).   */
#define PIC_T3CON_TMR3CS      PIC8_BIT(1)   /**< 0=Fosc/4, 1=external/T1OSC.      */
#define PIC_T3CON_TMR3ON      PIC8_BIT(0)   /**< Timer3 on/off.                    */

/* ───────────────────────── PIR2 / PIE2 / IPR2 bits (Reg 9-5/9-7/9-9) ── */
/* Same bit layout across the three registers: flag / enable / priority. */
#define PIC_PIR2_OSCFIF       PIC8_BIT(7)   /**< Oscillator fail flag.            */
#define PIC_PIR2_CMIF         PIC8_BIT(6)   /**< Comparator flag.                 */
#define PIC_PIR2_USBIF        PIC8_BIT(5)   /**< USB flag.                        */
#define PIC_PIR2_EEIF         PIC8_BIT(4)   /**< EEPROM write done flag.          */
#define PIC_PIR2_BCLIF        PIC8_BIT(3)   /**< MSSP bus collision flag.         */
#define PIC_PIR2_HLVDIF       PIC8_BIT(2)   /**< High/Low-voltage detect flag.    */
#define PIC_PIR2_TMR3IF       PIC8_BIT(1)   /**< Timer3 overflow flag.            */
#define PIC_PIR2_CCP2IF       PIC8_BIT(0)   /**< CCP2 flag.                       */
#define PIC_PIE2_OSCFIE       PIC8_BIT(7)
#define PIC_PIE2_CMIE         PIC8_BIT(6)
#define PIC_PIE2_USBIE        PIC8_BIT(5)
#define PIC_PIE2_EEIE         PIC8_BIT(4)
#define PIC_PIE2_BCLIE        PIC8_BIT(3)
#define PIC_PIE2_HLVDIE       PIC8_BIT(2)
#define PIC_PIE2_TMR3IE       PIC8_BIT(1)
#define PIC_PIE2_CCP2IE       PIC8_BIT(0)
#define PIC_IPR2_OSCFIP       PIC8_BIT(7)
#define PIC_IPR2_CMIP         PIC8_BIT(6)
#define PIC_IPR2_USBIP        PIC8_BIT(5)
#define PIC_IPR2_EEIP         PIC8_BIT(4)
#define PIC_IPR2_BCLIP        PIC8_BIT(3)
#define PIC_IPR2_HLVDIP       PIC8_BIT(2)
#define PIC_IPR2_TMR3IP       PIC8_BIT(1)
#define PIC_IPR2_CCP2IP       PIC8_BIT(0)

/* ───────────────────────── CCP1CON / CCP2CON bits (Register 16-1) ── */
/* CCP1 (ECCP1) has the P1M output-mode bits in <7:6>; CCP2 (plain) leaves
 * them unimplemented. DC1B/DC2B are the PWM duty LSBs (or capture/compare
 * 2 LSBs in 16-bit mode). CCP1M/CCP2M are the mode select (capture/
 * compare/PWM). DS39632E Register 16-1. */
#define PIC_CCP1_P1M_MASK     0xC0U    /**< P1M1:P1M0 at bits 7:6 (output mode). */
#define PIC_CCP1_DC1B_MASK    0x30U    /**< DC1B1:DC1B0 at bits 5:4 (duty LSBs). */
#define PIC_CCP1_M_MASK       0x0FU    /**< CCP1M3:CCP1M0 at bits 3:0 (mode).    */
#define PIC_CCP2_DC2B_MASK    0x30U    /**< DC2B1:DC2B0 at bits 5:4.            */
#define PIC_CCP2_M_MASK       0x0FU    /**< CCP2M3:CCP2M0 at bits 3:0.          */

/* ───────────────────────── ECCP1DEL bits (Register 16-2) ─────────── */
#define PIC_ECCP1DEL_PRSEN    PIC8_BIT(7)  /**< PWM restart enable (auto-restart). */
#define PIC_ECCP1DEL_PDC_MASK 0x7FU        /**< PDC6:PDC0, dead-band delay (6:0). */

/* ───────────────────────── ECCP1AS bits (Register 16-3) ─────────── */
#define PIC_ECCP1AS_ECCPASE   PIC8_BIT(7)  /**< Auto-shutdown event status (RO once active). */
#define PIC_ECCP1AS_SRC_MASK  0x70U        /**< ECCPAS2:ECCPAS0 at bits 6:4 (source). */
#define PIC_ECCP1AS_PSSAC_MASK 0x0CU       /**< PSSAC1:PSSAC0 at bits 3:2 (P1A/P1C state). */
#define PIC_ECCP1AS_PSSBD_MASK 0x03U       /**< PSSBD1:PSSBD0 at bits 1:0 (P1B/P1D state). */

/* ───────────────────────── MSSP bits (Register 19-1/19-2/19-4/19-5) ── */
/* SSPCON1 (mode/enable/polarity/flags), SSPSTAT (status), SSPCON2 (I2C
 * master control). Same bit positions as the PIC16 SSP. DS39632E §19.0. */
#define PIC_SSPCON1_SSPM_MASK  0x0FU       /**< SSPM3:SSPM0 at bits 3:0 (mode select). */
#define PIC_SSPCON1_CKP        PIC8_BIT(4)  /**< Clock polarity (SPI).                */
#define PIC_SSPCON1_SSPEN      PIC8_BIT(5)  /**< MSSP enable.                          */
#define PIC_SSPCON1_SSPOV      PIC8_BIT(6)  /**< Receive overflow.                    */
#define PIC_SSPCON1_WCOL       PIC8_BIT(7)  /**< Write collision.                     */
#define PIC_SSPCON2_SEN        PIC8_BIT(0)  /**< Start condition enable (I2C master). */
#define PIC_SSPCON2_RSEN       PIC8_BIT(1)  /**< Repeated start enable.               */
#define PIC_SSPCON2_PEN        PIC8_BIT(2)  /**< Stop condition enable.               */
#define PIC_SSPCON2_RCEN       PIC8_BIT(3)  /**< Receive enable.                      */
#define PIC_SSPCON2_ACKEN      PIC8_BIT(4)  /**< Acknowledge sequence enable.         */
#define PIC_SSPCON2_ACKDT      PIC8_BIT(5)  /**< Acknowledge data (ACK/NACK value).    */
#define PIC_SSPCON2_ACKSTAT    PIC8_BIT(6)  /**< Acknowledge status (from slave).      */
#define PIC_SSPCON2_GCEN       PIC8_BIT(7)  /**< General call enable (I2C slave).      */
#define PIC_SSPSTAT_BF         PIC8_BIT(0)  /**< Buffer full.                          */
#define PIC_SSPSTAT_UA         PIC8_BIT(1)  /**< Update address (10-bit).              */
#define PIC_SSPSTAT_RW         PIC8_BIT(2)  /**< Read/write (I2C).                     */
#define PIC_SSPSTAT_S          PIC8_BIT(3)  /**< Start (I2C).                          */
#define PIC_SSPSTAT_P          PIC8_BIT(4)  /**< Stop (I2C).                           */
#define PIC_SSPSTAT_DA         PIC8_BIT(5)  /**< Data/address (I2C).                   */
#define PIC_SSPSTAT_CKE        PIC8_BIT(6)  /**< Clock edge (SPI).                     */
#define PIC_SSPSTAT_SMP        PIC8_BIT(7)  /**< Sample phase (SPI master).             */

/* ───────────────────────── EUSART bits (Register 20-1/20-2/20-3) ────── */
/* TXSTA (Register 20-1) and RCSTA (Register 20-2) have the same bit layout
 * as the PIC16 USART, so the shared PIC_TXSTA_* / PIC_RCSTA_* names resolve
 * identically across families (only the PIC_REG_* address differs).
 * BAUDCON (Register 20-3) is the PIC18 EUSART addition. DS39632E §20.0. */
#define PIC_TXSTA_TX9D         PIC8_BIT(0)  /**< 9th bit of TX data.                  */
#define PIC_TXSTA_TRMT         PIC8_BIT(1)  /**< TSR empty (read-only).               */
#define PIC_TXSTA_BRGH         PIC8_BIT(2)  /**< High baud rate.                      */
#define PIC_TXSTA_SYNC         PIC8_BIT(4)  /**< Sync mode.                           */
#define PIC_TXSTA_TXEN         PIC8_BIT(5)  /**< TX enable.                           */
#define PIC_TXSTA_TX9          PIC8_BIT(6)  /**< 9-bit TX.                            */
#define PIC_TXSTA_CSRC         PIC8_BIT(7)  /**< Clock source (sync).                 */

