apojomovsky/pic8-hal/pic18fxx5x-hal/include/pic18fxx5x_sfr.h
#define PIC_RCSTA_RX9D         PIC8_BIT(0)  /**< 9th bit of RX data.                  */
#define PIC_RCSTA_OERR         PIC8_BIT(1)  /**< Overrun error.                       */
#define PIC_RCSTA_FERR         PIC8_BIT(2)  /**< Framing error.                       */
#define PIC_RCSTA_ADDEN        PIC8_BIT(3)  /**< Address detect (9-bit).              */
#define PIC_RCSTA_CREN         PIC8_BIT(4)  /**< Continuous receive.                  */
#define PIC_RCSTA_SREN         PIC8_BIT(5)  /**< Single receive.                      */
#define PIC_RCSTA_RX9          PIC8_BIT(6)  /**< 9-bit RX.                            */
#define PIC_RCSTA_SPEN         PIC8_BIT(7)  /**< Serial port enable.                  */

/* BAUDCON (Register 20-3) — the EUSART-specific control/status register. */
#define PIC_BAUDCON_ABDEN      PIC8_BIT(0)  /**< Auto-baud detect enable.            */
#define PIC_BAUDCON_WUE        PIC8_BIT(1)  /**< Wake-up enable (async).             */
#define PIC_BAUDCON_BRG16      PIC8_BIT(3)  /**< 16-bit baud generator (else 8-bit). */
#define PIC_BAUDCON_TXCKP      PIC8_BIT(4)  /**< Sync: TX clock polarity.            */
#define PIC_BAUDCON_RXDTP      PIC8_BIT(5)  /**< Sync: RX data polarity.             */
#define PIC_BAUDCON_RCIDL      PIC8_BIT(6)  /**< Receiver idle (read-only).          */
#define PIC_BAUDCON_ABDOVF     PIC8_BIT(7)  /**< Auto-baud overflow (read/clear).    */

/* ───────────────────────── CMCON bits (Register 22-1) ──────────────── */
/* Same bit layout as the PIC16 CMCON (DS39632E §22.0). Eight operating
 * modes are selected by CM2:CM0; POR default is 111 (comparators off). */
#define PIC_CMCON_CM_MASK      0x07U        /**< CM2:CM0 at bits 2:0 (mode select). */
#define PIC_CMCON_CIS          PIC8_BIT(3)  /**< Comparator input switch.            */
#define PIC_CMCON_C1INV        PIC8_BIT(4)  /**< C1 output inversion.                 */
#define PIC_CMCON_C2INV        PIC8_BIT(5)  /**< C2 output inversion.                 */
#define PIC_CMCON_C1OUT        PIC8_BIT(6)  /**< C1 output (read-only).              */
#define PIC_CMCON_C2OUT        PIC8_BIT(7)  /**< C2 output (read-only).              */

/* ───────────────────────── EECON1 bits (Register 7-1) ──────────────── */
/* RD/WR/WREN/WRERR mirror the PIC16 EECON1; EEPGD/CFGS/FREE select data
 * EEPROM vs program flash vs config (DS39632E §7.0). For data EEPROM
 * access, EEPGD = 0 and CFGS = 0. */
#define PIC_EECON1_RD          PIC8_BIT(0)  /**< Read control (strobe, self-clears). */
#define PIC_EECON1_WR          PIC8_BIT(1)  /**< Write control (strobe).             */
#define PIC_EECON1_WREN        PIC8_BIT(2)  /**< Write enable.                       */
#define PIC_EECON1_WRERR       PIC8_BIT(3)  /**< Write-error flag.                   */
#define PIC_EECON1_FREE        PIC8_BIT(4)  /**< Flash row erase enable.             */
#define PIC_EECON1_CFGS        PIC8_BIT(6)  /**< Config access (1) vs code/data (0). */
#define PIC_EECON1_EEPGD       PIC8_BIT(7)  /**< 0 = data EEPROM, 1 = program flash. */

/* ───────────────────────── Reset values (POR) ───────────────────── */
/* DS39632E Table 5-1 "Value at POR" column + Register 4-1 reset notes.
 * RCON after POR: IPEN=0, SBOREN=1, RI=0, TO=1, PD=1, POR=1, BOR=1
 * (POR/BOR set per Register 4-1 Note 1). IPR1 defaults to all-high
 * priority. T0CON resets to 0xFF (on, 8-bit, external, no prescaler). */
#define PIC_STATUS_POR_VALUE     0x00U
#define PIC_BSR_POR_VALUE        0x00U
#define PIC_RCON_POR_VALUE       0x57U
#define PIC_INTCON_POR_VALUE     0x00U
#define PIC_INTCON2_POR_VALUE    0xFBU
#define PIC_INTCON3_POR_VALUE    0xC0U
#define PIC_PIR1_POR_VALUE       0x00U
#define PIC_PIE1_POR_VALUE       0x00U
#define PIC_IPR1_POR_VALUE       0xFFU
#define PIC_T0CON_POR_VALUE      0xFFU
#define PIC_T1CON_POR_VALUE      0x00U
#define PIC_T2CON_POR_VALUE      0x00U
#define PIC_T3CON_POR_VALUE      0x00U
#define PIC_PR2_POR_VALUE        0xFFU
#define PIC_PIR2_POR_VALUE       0x00U
#define PIC_PIE2_POR_VALUE       0x00U
#define PIC_IPR2_POR_VALUE       0xFFU
#define PIC_CCP1CON_POR_VALUE    0x00U
#define PIC_CCP2CON_POR_VALUE    0x00U
#define PIC_ECCP1DEL_POR_VALUE   0x00U
#define PIC_ECCP1AS_POR_VALUE    0x00U
#define PIC_SSPCON1_POR_VALUE    0x00U
#define PIC_SSPCON2_POR_VALUE    0x00U
#define PIC_SSPSTAT_POR_VALUE    0x00U
#define PIC_SSPADD_POR_VALUE     0x00U
/* EUSART: TXSTA resets to 0x02 (TRMT=1, TSR empty); the rest are clear.
 * DS39632E Table 5-1. */
#define PIC_BAUDCON_POR_VALUE   0x00U
#define PIC_RCSTA_POR_VALUE     0x00U
#define PIC_TXSTA_POR_VALUE     0x02U
#define PIC_SPBRG_POR_VALUE     0x00U
#define PIC_SPBRGH_POR_VALUE    0x00U
/* CMCON resets to 0x07 (CM2:CM0 = 111, comparators off — the POR default,
 * DS39632E Figure 22-1). */
#define PIC_CMCON_POR_VALUE     0x07U
/* EECON1 resets to 0x00 (RD/WR/WREN clear, EEPGD=0 -> data EEPROM).
 * DS39632E Table 5-1. */
#define PIC_EECON1_POR_VALUE    0x00U
#define PIC_TRIS_POR_VALUE       0xFFU   /* All pins inputs after POR. */
#define PIC_LAT_POR_VALUE        0x00U   /* Output latches clear after POR. */
#define PIC_PORT_POR_VALUE       0x00U

#endif /* PIC18FXX5X_SFR_H */